Catalogs/КатегорииЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>КатегорииЭксплуатации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмущественныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокЭксплуатации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоФизЛицам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьВВидеГрупповогоОС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКапитализацииСтоимостиОС</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНаработку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемНаработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияНаработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПогашенияСтоимостиБУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПогашенияСтоимостиНУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыОбновлены258</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПартииТМЦВЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ПартииТМЦВЭксплуатации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КатегорияЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокЭксплуатации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаЭксплуатации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияЭксплуатации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннееПотребление</v8:Type>
						<v8:Type>cfg:DocumentRef.ПервичныйДокумент</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковТМЦВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИнвентарныйНомерТМЦВЭксплуатации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияНаработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемНаработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПогашенияСтоимостиБУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПогашенияСтоимостиНУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоваяПартия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииТМЦВЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партия258</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИнвентарныйНомер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИнвентарныйНомерТМЦВЭксплуатации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ТМЦВЭксплуатацииКлиент/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции подсистемы ТМЦ в эксплуатации.
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// 
// Параметры:
//  ТекущаяСтрока - Структура - 
//  СтруктураДействий - Структура - 
//  КэшированныеЗначения - Структура - 
// 
// Возвращаемое значение:
//  Булево -
Функция НеобходимВызовСервераДляОбработкиСтрокиТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	Если СтруктураДействий.Свойство("ЗаполнитьПризнакиКатегорииЭксплуатации") Тогда
		Если ЗначениеЗаполнено(ТекущаяСтрока.КатегорияЭксплуатации)
			И КэшированныеЗначения.ПризнакиКатегорииЭксплуатации.Получить(ТекущаяСтрока.КатегорияЭксплуатации) = Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// См. ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ
Процедура ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения, ДополнительныеПараметрыЗаполнения = Неопределено) Экспорт
	
	ЗаполнитьПризнакиКатегорииЭксплуатации(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

// Обрабатывает строку при изменении категории эксплуатации.
// 
// Параметры:
//  ДанныеСтроки - ДанныеФормыСтруктура, Массив из ДанныеФормыСтруктура - Текущая строка.
//  ТабличнаяЧасть - ДанныеФормыКоллекция - Табличная часть.
//  СтруктураДействий - Структура - Структура действий.
//	ПолеКоличество - Строка - Поле "Количество".
Процедура ОбработатьСтрокуПриИзмененииКатегорииЭксплуатации(ДанныеСтроки, ТабличнаяЧасть, СтруктураДействий = Неопределено, ПолеКоличество = "") Экспорт
	
	Если ПолеКоличество = "" Тогда
		ПолеКоличество = "КоличествоУпаковок";
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДанныеСтроки", ДанныеСтроки);
	ДополнительныеПараметры.Вставить("ТабличнаяЧасть", ТабличнаяЧасть);
	ДополнительныеПараметры.Вставить("СтруктураДействий", СтруктураДействий);
	ДополнительныеПараметры.Вставить("ПолеКоличество", ПолеКоличество);

	Если ТипЗнч(ДанныеСтроки) = Тип("Массив") Тогда
		
		ТребуетсяРазбитьСтроки = Ложь;
		
		Для Каждого ИДСтроки Из ДанныеСтроки Цикл
			ТекущаяСтрока = ТабличнаяЧасть.НайтиПоИдентификатору(ИДСтроки);
		 	Если ЗначениеЗаполнено(ТекущаяСтрока.КатегорияЭксплуатации) 
				И ТекущаяСтрока.ИнвентарныйУчет
				И ТекущаяСтрока[ПолеКоличество] > 1 Тогда
		 		ТребуетсяРазбитьСтроки = Истина;
		 		Прервать
		 	КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		ТребуетсяРазбитьСтроки = 
			ЗначениеЗаполнено(ДанныеСтроки.КатегорияЭксплуатации) 
			И ДанныеСтроки.ИнвентарныйУчет
			И ДанныеСтроки[ПолеКоличество] > 1;
			
	КонецЕсли;
	
	Если ТребуетсяРазбитьСтроки Тогда

		Если ТипЗнч(ДанныеСтроки) = Тип("Массив")
			И ДанныеСтроки.Количество() > 1 Тогда
			
			ТекстВопроса = НСтр("ru = 'В категории эксплуатации включен инвентарный учет, количество должно быть равным 1.
								|Разбить строки или установить количество равным 1?'");
								
			ТекстКнопки = НСтр("ru = 'Разбить строки'");
			
		Иначе
			
			ТекстВопроса = НСтр("ru = 'В категории эксплуатации включен инвентарный учет, количество должно быть равным 1.
								|Разбить строку или установить количество равным 1?'");
								
			ТекстКнопки = НСтр("ru = 'Разбить строку'");
			
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьСтрокуПриИзмененииКатегорииЭксплуатацииЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		СписокКнопок = Новый СписокЗначений();
		СписокКнопок.Добавить(КодВозвратаДиалога.Да, ТекстКнопки);
		СписокКнопок.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Изменить количество'"));
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, СписокКнопок);
		
	Иначе
		
		ОбработатьСтрокуПриИзмененииКатегорииЭксплуатацииЗавершение(КодВозвратаДиалога.Нет, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

// 
// Параметры:
//  СтруктураПолейТЧ - Структура - Структура полей ТЧ
//  ТекущаяСтрока - Структура - Текущая строка
//  СтруктураДействий - Структура - Структура действий
//  ДополнительныеПараметрыЗаполнения - Структура - Дополнительные параметры заполнения
Процедура ДополнитьТекущуюСтрокуСтруктурой(СтруктураПолейТЧ, ТекущаяСтрока, СтруктураДействий, ДополнительныеПараметрыЗаполнения) Экспорт
	
	Если СтруктураДействий.Свойство("ЗаполнитьПризнакиКатегорииЭксплуатации") Тогда
		СтруктураПолейТЧ.Вставить("КатегорияЭксплуатации");
		СтруктураПолейТЧ.Вставить("ИнвентарныйУчет");
		СтруктураПолейТЧ.Вставить("УчетПоФизЛицам");
		СтруктураПолейТЧ.Вставить("УчитыватьВВидеГрупповогоОС");
		СтруктураПолейТЧ.Вставить("СпособПогашенияСтоимостиБУ");
		СтруктураПолейТЧ.Вставить("СтатьяРасходов");
		СтруктураПолейТЧ.Вставить("СрокЭксплуатации");
	КонецЕсли;
	
КонецПроцедуры

// Обработчик команды заполнения категории эксплуатации в выделенных строках таблицы.
// 
// Параметры:
// 	ТабличнаяЧасть - ДанныеФормыКоллекция - Табличная часть.
// 	ВыделенныеСтроки - Массив из Число - Выделенные строки таблицы формы.
// 	ПараметрыВыбора - Структура - Параметры отбора.
// 	ОписаниеОповещенияПослеЗаполнения - ОписаниеОповещения - Описания оповещения, которое необходимо вызвать после заполнения.
//
Процедура ЗаполнитьКатегориюЭксплуатации(ТабличнаяЧасть, ВыделенныеСтроки, ПараметрыВыбора = Неопределено, ОписаниеОповещенияПослеЗаполнения = Неопределено) Экспорт
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ТабличнаяЧасть", ТабличнаяЧасть);
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	ДополнительныеПараметры.Вставить("ОписаниеОповещенияПослеЗаполнения", ОписаниеОповещенияПослеЗаполнения);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьКатегориюЭксплуатацииЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Справочник.КатегорииЭксплуатации.ФормаВыбора", ПараметрыВыбора,,,,, ОписаниеОповещения);
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Открывает додобор ТМЦ в эксплуатации.
// 
// Параметры:
//  ПараметрыФормы - Структура - Параметры формы
//	Форма - ФормаКлиентскогоПриложения - Форма
Процедура ПодобратьТМЦВЭксплуатации(ПараметрыФормы, Форма) Экспорт
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Документ.ПрочееОприходованиеТоваров.ФормаДокумента.Команда.ПодобратьТМЦВЭксплуатации");
	
	ИмяФормы = "Справочник.ПартииТМЦВЭксплуатации.Форма.ФормаПодбораУТ";
	
	ОткрытьФорму(ИмяФормы, ПараметрыФормы, Форма);
	
КонецПроцедуры

Процедура ЗаполнитьПризнакиКатегорииЭксплуатации(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)
	
	Если НЕ СтруктураДействий.Свойство("ЗаполнитьПризнакиКатегорииЭксплуатации") Тогда
		Возврат;
	КонецЕсли;
		
	СтруктураПризнаков = КэшированныеЗначения.ПризнакиКатегорииЭксплуатации.Получить(
		ТекущаяСтрока.КатегорияЭксплуатации);
		
	Если СтруктураПризнаков <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтруктураПризнаков);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьСтрокуПриИзмененииКатегорииЭксплуатацииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да 
		И РезультатВопроса <> КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;

	ДанныеСтроки = ДополнительныеПараметры.ДанныеСтроки;
	ТабличнаяЧасть = ДополнительныеПараметры.ТабличнаяЧасть; // ТабличнаяЧасть
	ПолеКоличество = ДополнительныеПараметры.ПолеКоличество;
	Разбить = (РезультатВопроса = КодВозвратаДиалога.Да);
	СтруктураДействий = ДополнительныеПараметры.СтруктураДействий; // Структура
	
	ЕстьУпаковка = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеСтроки, "Упаковка");
	
	Если ТипЗнч(ДанныеСтроки) = Тип("Массив") Тогда
		
		СписокСтрок = Новый Массив;
		Для Каждого ИДСтроки Из ДанныеСтроки Цикл
			ТекущаяСтрока = ТабличнаяЧасть.НайтиПоИдентификатору(ИДСтроки);
			СписокСтрок.Добавить(ТекущаяСтрока);
		КонецЦикла;
		
	Иначе
		СписокСтрок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеСтроки);
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из СписокСтрок Цикл
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.КатегорияЭксплуатации) 
			И ТекущаяСтрока.ИнвентарныйУчет Тогда
				
			КоличествоВСтроке = ТекущаяСтрока.Количество - 1;
			
			ТекущаяСтрока[ПолеКоличество] = 1;
			ТекущаяСтрока.Количество = 1;
			
			Если ЕстьУпаковка Тогда
				ТекущаяСтрока.Упаковка = ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка");
			КонецЕсли;
			
			Если СтруктураДействий <> Неопределено Тогда
				КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
				ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
			КонецЕсли;
			
			Если Разбить Тогда
				
				Пока КоличествоВСтроке > 0 Цикл
					
					НоваяСтрока = ТабличнаяЧасть.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
					НоваяСтрока.ИнвентарныйНомер = "";
					
					Если СтруктураДействий <> Неопределено Тогда
						ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
					КонецЕсли;
					
					КоличествоВСтроке = КоличествоВСтроке - 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			
			Если НЕ ТекущаяСтрока.ИнвентарныйУчет Тогда
				ТекущаяСтрока.ИнвентарныйНомер = "";
			КонецЕсли;
	
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьКатегориюЭксплуатацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТабличнаяЧасть = ДополнительныеПараметры.ТабличнаяЧасть;
	ВыделенныеСтроки = ДополнительныеПараметры.ВыделенныеСтроки;
	
	Для каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		
		ДанныеСтроки = ТабличнаяЧасть.НайтиПоИдентификатору(ИдентификаторСтроки);
		ДанныеСтроки.КатегорияЭксплуатации = Результат;
		
	КонецЦикла;
	
	Если ДополнительныеПараметры.ОписаниеОповещенияПослеЗаполнения <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещенияПослеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
